Revit 2027 API
BuiltInFailures.FamilyFailures.DeletingBadFamElemCorruption Property
 Family contains invalid elements. They will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletingBadFamElemCorruption { get; }
Public Shared ReadOnly Property DeletingBadFamElemCorruption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletingBadFamElemCorruption {
	FailureDefinitionId^ get ();
}
static member DeletingBadFamElemCorruption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace